{"config": [{"config": {"dtype": "float32", "stateful": false, "unroll": false, "dropout": 0.0, "activation": "tanh", "implementation": 0, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "unit_forget_bias": true, "units": 16, "name": "lstm_1", "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, 10, 30], "bias_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 16, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 1, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}